results_shopcart-sim-native/run_5_2026-01-05_03-28-16/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.610ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.356ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.491ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.342ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.232ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.222ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.221ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.154ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.182ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.169ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.171ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.147ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.117ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.136ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.157ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  423.82us   6.46ms   67.86%
    Req/Sec    52.86     52.41   111.00     78.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.64ms
 90.000%    1.91ms
 99.000%    2.32ms
 99.900%    2.72ms
 99.990%    5.84ms
 99.999%    6.46ms
100.000%    6.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.250     0.000000            1         1.00
       0.818     0.100000         1602         1.11
       0.994     0.200000         3197         1.25
       1.126     0.300000         4809         1.43
       1.248     0.400000         6399         1.67
       1.360     0.500000         7996         2.00
       1.414     0.550000         8814         2.22
       1.466     0.600000         9593         2.50
       1.523     0.650000        10394         2.86
       1.581     0.700000        11206         3.33
       1.642     0.750000        11991         4.00
       1.674     0.775000        12389         4.44
       1.713     0.800000        12790         5.00
       1.755     0.825000        13198         5.71
       1.801     0.850000        13588         6.67
       1.852     0.875000        13989         8.00
       1.881     0.887500        14191         8.89
       1.907     0.900000        14390        10.00
       1.942     0.912500        14588        11.43
       1.980     0.925000        14790        13.33
       2.019     0.937500        14989        16.00
       2.039     0.943750        15088        17.78
       2.065     0.950000        15186        20.00
       2.091     0.956250        15289        22.86
       2.113     0.962500        15388        26.67
       2.151     0.968750        15493        32.00
       2.169     0.971875        15540        35.56
       2.189     0.975000        15591        40.00
       2.207     0.978125        15641        45.71
       2.225     0.981250        15686        53.33
       2.261     0.984375        15737        64.00
       2.277     0.985938        15760        71.11
       2.289     0.987500        15785        80.00
       2.305     0.989062        15810        91.43
       2.325     0.990625        15835       106.67
       2.349     0.992188        15860       128.00
       2.365     0.992969        15872       142.22
       2.379     0.993750        15886       160.00
       2.393     0.994531        15897       182.86
       2.413     0.995313        15910       213.33
       2.429     0.996094        15922       256.00
       2.451     0.996484        15928       284.44
       2.469     0.996875        15935       320.00
       2.481     0.997266        15941       365.71
       2.495     0.997656        15948       426.67
       2.521     0.998047        15953       512.00
       2.539     0.998242        15956       568.89
       2.605     0.998437        15960       640.00
       2.641     0.998633        15964       731.43
       2.657     0.998828        15966       853.33
       2.721     0.999023        15969      1024.00
       2.749     0.999121        15970      1137.78
       2.837     0.999219        15972      1280.00
       2.981     0.999316        15974      1462.86
       2.989     0.999414        15975      1706.67
       3.239     0.999512        15977      2048.00
       3.239     0.999561        15977      2275.56
       3.597     0.999609        15978      2560.00
       5.167     0.999658        15979      2925.71
       5.171     0.999707        15980      3413.33
       5.291     0.999756        15981      4096.00
       5.291     0.999780        15981      4551.11
       5.291     0.999805        15981      5120.00
       5.839     0.999829        15982      5851.43
       5.839     0.999854        15982      6826.67
       5.847     0.999878        15983      8192.00
       5.847     0.999890        15983      9102.22
       5.847     0.999902        15983     10240.00
       5.847     0.999915        15983     11702.86
       5.847     0.999927        15983     13653.33
       6.459     0.999939        15984     16384.00
       6.459     1.000000        15984          inf
#[Mean    =        1.362, StdDeviation   =        0.424]
#[Max     =        6.456, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.50
Transfer/sec:    244.80KB